demoapp/app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    # just sleep 5 seconds
    sleep 5

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 21 Jun 2012 10:29:47 UTC +00:00], ["email", ""], ["name", ""], ["updated_at", Thu, 21 Jun 2012 10:29:47 UTC +00:00]]